LeetCode - Pandas Question

In [2]:
import pandas as pd
import numpy as np

In [3]:
##595 - Big Countries

#DF
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

#Task
'''
A country is big if:

it has an area of at least three million (i.e., 3000000 km2), or
it has a population of at least twenty-five million (i.e., 25000000).
Write a solution to find the name, population, and area of the big countries.

Return the result table in any order.
'''

#Solution
world[(world['area']>=3000000) | (world['population']>=25000000)][['name','population','area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [4]:
##1757 - Recyclable and Low Fat Products

#DF
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})

#Task
'''
Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.
'''

#Solution
products[(products['low_fats'] == "Y") & (products['recyclable'] == "Y")][['product_id']]

   product_id
1           1
3           3

In [5]:
##183 - Customers Who Never Order

#DF
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

#Task
'''
Write a solution to find all customers who never order anything.

Return the result table in any order.
'''
##Solution 1
#customers.loc[~customers['id'].isin(orders['customerId'])].rename(columns = {'name' : 'customers'})[['customers']]

##Solution 2
customers[~customers.id.isin(orders.customerId)][['name']].rename(columns = { 'name' : 'Customers'})

  Customers
1     Henry
3       Max

In [6]:
##1148 - Article Views

#DF
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

#Task
'''
Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.
'''

#Solution
views[views['author_id'] == views['viewer_id']][['author_id']].rename(columns = {'author_id' : 'id'}).drop_duplicates().sort_values(by = 'id', ascending = True)

#Solution 2
views[views['author_id'] == views['viewer_id']][['author_id']].rename(columns = {'author_id' : 'id'}).sort_values(by = 'id', ascending = True).drop_duplicates(subset = 'id')

   id
5   4
2   7

In [7]:
##1683 - Invalid Tweets

#DF
data = [[1, 'Let us Code'], [2, 'More than fifteen chars are here!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

#Task
'''
Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Return the result table in any order.
'''

#Solution
tweets[tweets['content'].str.len()> 15][['tweet_id']]

   tweet_id
1         2

In [8]:
##1873 - Calculate Special Bonus

#DF
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

#Task
'''
Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number 
and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.
'''

#Solution
employees.assign(bonus = employees['salary'].where(
    (~employees['name'].str.startswith('M')) & (employees['employee_id'] % 2 >0),0)).sort_values('employee_id')[['employee_id','bonus']]

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

In [9]:
##1667 - Fix Names in a Table

#DF
data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

#Task
'''
Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.
'''

#Solution
users['name'] = users['name'].str.capitalize()
users.sort_values('user_id')

   user_id   name
0        1  Alice
1        2    Bob

In [10]:
#1517 - Find Users with Valid Emails

#DF
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})

#Task
'''
Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.
'''

#Solution
users[users['mail'].str.match(r'^[A-Za-z][A-Za-z0-9_.-]*leetcode[.]com$')]

Empty DataFrame
Columns: [user_id, name, mail]
Index: []

In [11]:
#1527 - Patients With a Condition

#DF
data = [[1, 'Daniel', 'YFEV COUGH'], [2, 'Alice', ''], [3, 'Bob', 'DIAB100 MYOP'], [4, 'George', 'ACNE DIAB100'], [5, 'Alain', 'DIAB201']]
patients = pd.DataFrame(data, columns=['patient_id', 'patient_name', 'conditions']).astype({'patient_id':'int64', 'patient_name':'object', 'conditions':'object'})

#Task
'''
Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. 
Type I Diabetes always starts with DIAB1 prefix.
'''

#Solution

patients[patients.conditions.str.contains(r'(^DIAB1)|( DIAB1)')]

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_14840\1096965828.py:15: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  patients[patients.conditions.str.contains(r'(^DIAB1)|( DIAB1)')]

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

In [12]:
##177 - Nth Highest Salary

#DF
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'salary']).astype({'Id':'Int64', 'salary':'Int64'})

#Task
'''
Write a solution to find the nth highest distinct salary from the Employee table. If there are less than n distinct salaries, return null.
'''
N = 2
#Solution
employee['rank'] = employee['salary'].rank(method='dense', ascending=False)
ranked = employee[employee['rank'] == N]
pd.DataFrame({f'getNthHighestSalary({N})': [None if len(ranked) == 0 else ranked['salary'].iloc[0]]})

   getNthHighestSalary(2)
0                     200

In [13]:
##176 - Second Highest Salary

#DF
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

#Task
'''
Write a solution to find the second highest distinct salary from the Employee table. 
If there is no second highest salary, return null (return None in Pandas).
'''

#Solution 1

f_salary = employee.drop_duplicates('salary')

if len(f_salary) < 2:
    pd.DataFrame({'Second Highest Salary': [None]})
else:
    f_salary['rank'] = f_salary['salary'].rank(method = 'dense', ascending = False)
    secondrank = f_salary[f_salary['rank'] == 2]
    secondrank = secondrank.rename(columns = {'salary' : 'SecondHighestSalary'})
    secondrank[['SecondHighestSalary']]

secondrank[['SecondHighestSalary']]


#Solution 2

df = pd.DataFrame({'SecondHighestSalary':[]})

if employee.salary.nunique()<2:
    df.loc[0, :]= np.nan #row label, column label
else:
    df.loc[0, :] = employee.salary.drop_duplicates().sort_values(ascending = False).iloc[1]
df


#Solution 3
def getSecondHighestSalary(employee):
    s = employee['salary'].drop_duplicates().nlargest(2)
    return pd.DataFrame({'SecondHighestSalary': [s.iloc[1] if len(s) ==2 else none]})

getSecondHighestSalary(employee)

#Solution 4
unique = employee.salary.drop_duplicates()

if len(unique)<2:
    pd.DataFrame({'SecondHighestSalary' : [None] })
else: 
    sort = unique.sort_values(ascending = False)
    second = sort.iloc[1]
    df = pd.DataFrame({'SecondHighestSalary': [second]})

df

   SecondHighestSalary
0                  200

In [14]:
##184 - Department Highest Salary


#DF
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

#Task
'''
Write a solution to find employees who have the highest salary in each of the departments.

Return the result table in any order.
'''

#Solution
employee = employee.rename(columns = {'name' : 'Employee', 'salary' : 'Salary'})
department = department.rename(columns = {'name' : 'Department'})

employee = employee.merge(department[['id','Department']], left_on = 'departmentId', right_on = 'id', how = 'left')

employee.loc[employee.groupby('Department')['Salary'].rank(ascending = False, method = 'min') == 1][['Department','Employee','Salary']]

'''
#Solution - only have one largest
employee = employee.rename(columns = {'name' : 'Employee', 'salary' : 'Salary'})
department = department.rename(columns = {'name' : 'Department'})

employee = employee.merge(department[['id','Department']], left_on = 'departmentId', right_on = 'id', how = 'left')

employee.loc[employee.groupby('Department')['Salary'].idxmax()][['Department','Employee','Salary']].reset_index(drop = True)
'''

'''
Renaming Columns

df.columns = ['column1,'column2','column3']
Transform + groupby = Apply the result into each group
'''

"\nRenaming Columns\n\ndf.columns = ['column1,'column2','column3']\nTransform + groupby = Apply the result into each group\n"

In [15]:
##178 - Rank Scores

#DF
data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

#Task
'''
Write a solution to find the rank of the scores. The ranking should be calculated according to the following rules:

The scores should be ranked from the highest to the lowest.
If there is a tie between two scores, both should have the same ranking.
After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.
Return the result table ordered by score in descending order.
'''

#Solution
scores['rank'] = scores['score'].rank(method = 'dense', ascending = False)
scores.sort_values('rank')[['score','rank']]

   score  rank
2    4.0   1.0
4    4.0   1.0
3   3.85   2.0
1   3.65   3.0
5   3.65   3.0
0    3.5   4.0

In [16]:
##Deletes Duplicate Emails

#DF
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

#Task
'''
Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.
For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.
For Pandas users, please note that you are supposed to modify Person in place.
After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.
'''

'''
inplace = True, modify the original data
'''

#Solution
person.sort_values('id').drop_duplicates(subset = 'email', keep = 'first')

   id             email
0   1  john@example.com
1   2   bob@example.com

In [17]:
##1795 - Rearrange Product Table 

#DF
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

#Task
'''
Write a solution to rearrange the Products table so that each row has (product_id, store, price). 
If a product is not available in a store, do not include a row with that product_id and store combination in the result table.
Return the result table in any order.
'''

melted = pd.melt(
    products,
    id_vars = 'product_id',
    value_vars = ('store1','store2','store3'),
    var_name = 'store',
    value_name = 'price',
)

melted.dropna(subset = 'price')

   product_id   store  price
0           0  store1     95
1           1  store1     70
2           0  store2    100
4           0  store3    105
5           1  store3     80

In [18]:
##1907 - Count Salary Categories

#DF
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

#Task
'''
Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

"Low Salary": All the salaries strictly less than $20000.
"Average Salary": All the salaries in the inclusive range [$20000, $50000].
"High Salary": All the salaries strictly greater than $50000.
The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.
'''

#Solution 1

i = accounts['income']

conditions = [
    (i < 20000),
    (i >= 20000) & (i <= 50000),
    (i > 50000)
]

choose = ['Low Salary', 'Average Salary', 'High Salary']

accounts['category'] = np.select(conditions, choose, default = 0)
accounts['category'] = pd.Categorical(accounts['category'], categories = ['Low Salary', 'Average Salary', 'High Salary'])


accounts.groupby('category', observed = False).agg(
    accounts_count = ('account_id','count')).reset_index()

#Solution 2
bins = [-np.inf, 20000, 50001, np.inf]

labels = ['Low Salary', 'Average Salary', 'High Salary']
accounts['category'] = pd.cut(accounts['income'], bins = bins, labels = labels, right = False)
accounts.groupby('category').size().reset_index(name = 'accounts_count')

#Solution 3
output = pd.DataFrame({
        'category' : ['High Salary', 'Low Salary', 'Average Salary'],
        'accounts_count': [len(accounts[accounts['income'] > 50000]),
                  len(accounts[accounts['income'] < 20000]),
                  len(accounts[(accounts['income'] >= 20000) & (accounts['income'] <= 50000)])
                    ]
    })

output

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_14840\3871097727.py:43: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  accounts.groupby('category').size().reset_index(name = 'accounts_count')

         category  accounts_count
0     High Salary               3
1      Low Salary               1
2  Average Salary               0

In [19]:
##1741 - Find Total Time Spent by Each Employee

#DF
data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

#Task
'''
Write a solution to calculate the total time in minutes spent by each employee on each day at the office. 
Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.
Return the result table in any order.
'''

#Solution 1
employees['total_time'] = employees['out_time'] - employees['in_time']
employees.groupby(['event_day','emp_id'])['total_time'].sum().reset_index().rename(columns = {'event_day' : 'day'})

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-11-28       2          30
2 2020-12-03       1          41
3 2020-12-09       2          27

In [20]:
##511 Game Play Analysis

#DF
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

#Task
'''
Write a solution to find the first login date for each player.

Return the result table in any order.

column = player_id, first_login
'''

#Solution 1
activity.sort_values(by = 'event_date').drop_duplicates(subset = 'player_id', keep = 'first')[['player_id','event_date']].rename(columns = {'event_date' : 'first_login'})

#Solution 2
activity.groupby('player_id')['event_date'].min().reset_index().rename(columns = {'event_date' : 'first_login'})

#or 

activity.groupby('player_id').agg(
    first_login = ('event_date', 'min')).reset_index()

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

In [21]:
##2356 - Number of Unique Subjects Taught by Each Teacher


#DF
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

#Task
'''
Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Return the result table in any order.

columns = teacher_id, cnt
'''

#Solution 

teacher.groupby('teacher_id').agg(
    cnt = ('subject_id','nunique')).reset_index()

   teacher_id  cnt
0           1    2
1           2    4

In [22]:
##596 - Classes With at Least 5 Students

#DF
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

#Task
'''
Write a solution to find all the classes that have at least five students.

Return the result table in any order.

column - class
'''

#Solution 1
courses = courses.groupby('class')['student'].size().reset_index()
courses[courses['student']>4][['class']]

#Solution 2
(
    courses.groupby('class')
    .filter(lambda x: len(x) >=5)
    [['class']]
    .drop_duplicates()
)

Empty DataFrame
Columns: [class]
Index: []

In [23]:
##586 Customer Placing Largest Number of Orders

#DF 
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

#Task
'''
Write a solution to find the customer_number for the customer who has placed the largest number of orders.

The test cases are generated so that exactly one customer will have placed more orders than any other customer.

column - customer_number
'''

#Solution
orders.groupby('customer_number')['order_number'].size().nlargest(1).reset_index()

   customer_number  order_number
0                3             2

In [24]:
##1484 - Group Sold Products By The Date

#DF
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

#Task
'''
Write a solution to find for each date the number of different products sold and their names.
The sold products names for each date should be sorted lexicographically.
Return the result table ordered by sell_date.

columns - sell_date, num_sold, products
'''

#Solution
(
    activities.groupby('sell_date')
    .agg(
        num_sold = ('product','count'),
        products = ('product', lambda x: ','.join(sorted(x.unique())))
        )
        .reset_index().sort_values('sell_date')
    )

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         2                          Mask

In [25]:
##1693 - Daily Leads and Partners

#DF
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})


#Task
'''
For each date_id and make_name, find the number of distinct lead_id's and distinct partner_id's.

Return the result table in any order.

columns - date_id, make_name, unique_leads, unique_partners
'''

#Solution
daily_sales.groupby(['date_id','make_name']).agg(
    unique_leads = ('lead_id', 'nunique'),
    unique_partners = ('partner_id','nunique')).reset_index()

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

In [26]:
##1050 - Actors and Directors who Cooperated at Least Three Times

#DF
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

#Task
'''
Write a solution to find all the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.
Return the result table in any order.

Columns - actor_id, director_id
'''

actor_director.groupby(['actor_id','director_id']).filter(lambda x : len(x) >= 3).reset_index()[['actor_id','director_id']].drop_duplicates()

   actor_id  director_id
0         1            1

In [27]:
##1378 - Replace Employee ID with the Unique Identifier

#DF
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

#Task
'''
Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.
Return the result table in any order.

columns - unique_id, name
'''

employees.merge(employee_uni, on = 'id', how = 'left')[['unique_id','name']]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

In [28]:
##1280 - Students and Examination

#DF
data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

#Task
'''
Write a solution to find the number of times each student attended each exam.
Return the result table ordered by student_id and subject_name.
columns - student_id, student_name, subject_name, attended_exams
'''

x = examinations.groupby(['student_id', 'subject_name']).size().reset_index(name = 'attended_exams')

(
    students.merge(subjects, how = 'cross')
    .merge(x, on = ['student_id','subject_name'], how = 'left').reset_index(drop = True)
    .fillna({'attended_exams' : 0})
    .sort_values(by = ['student_id','subject_name'], ascending = [True, True])
)

    student_id student_name subject_name  attended_exams
0            1        Alice         Math             3.0
1            1        Alice      Physics             2.0
2            1        Alice  Programming             1.0
3            2          Bob         Math             1.0
4            2          Bob      Physics             0.0
5            2          Bob  Programming             1.0
9            6         Alex         Math             0.0
10           6         Alex      Physics             0.0
11           6         Alex  Programming             0.0
6           13         John         Math             1.0
7           13         John      Physics             1.0
8           13         John  Programming             1.0

In [29]:
##570 - Managers with at Least 5 Direct Reports

#DF
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

#Task
'''
Write a solution to find managers with at least five direct reports.
Return the result table in any order.

Columns - name
'''

#Solution
employee

employee.groupby('managerId').size().reset_index(name = 'cnt').merge(employee,left_on = 'managerId', right_on = 'id', how = 'right').query('cnt>=5')[['name']]

   name
0  John

In [30]:
##607 - Sales Person

#DF
data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})

#Task
'''
Write a solution to find the names of all the salespersons who did not have any orders related to the company with the name "RED".

Return the result table in any order.

column - name
'''

#Solution 1
(
    sales_person.merge(orders[['sales_id','com_id']],on = 'sales_id', how = 'left')
    .merge(company[['com_id','name']], on = 'com_id', how = 'left', suffixes = ('', '_company'))
    .groupby('sales_id')
    .filter(lambda g: "RED" not in g['name_company'].values)
    [['name']]
    .drop_duplicates()
)

#Solution 2
data = orders.merge(company, on = 'com_id').query('  name == "RED"  ')['sales_id']
sales_person[~sales_person['sales_id'].isin(data)][['name']]

   name
1   Amy
2  Mark
4  Alex

In [31]:
##1378 - Replace Employee ID With The Unique Identifier

#DF
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

#Task
'''
Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.
Return the result table in any order.
The result format is in the following example.

column - unique_id, name
'''

employees.merge(employee_uni, on = 'id', how = 'left')[['unique_id','name']]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

In [32]:
##1581 - Customer Who Visited but Did Not Make Any Transactions

#DF
data = [[1, 23], [2, 9], [4, 30], [5, 54], [6, 96], [7, 54], [8, 54]]
visits = pd.DataFrame(data, columns=['visit_id', 'customer_id']).astype({'visit_id':'Int64', 'customer_id':'Int64'})
data = [[2, 5, 310], [3, 5, 300], [9, 5, 200], [12, 1, 910], [13, 2, 970]]
transactions = pd.DataFrame(data, columns=['transaction_id', 'visit_id', 'amount']).astype({'transaction_id':'Int64', 'visit_id':'Int64', 'amount':'Int64'})

#Task
'''
Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.
Return the result table sorted in any order.
The result format is in the following example.

column - customer_id, count_no_trans
'''

#Solution 1
visits.merge(transactions, on = 'visit_id', how = 'left').groupby('customer_id').agg(
    count_no_trans = ('transaction_id', lambda x: x.isnull().sum())).reset_index().query('count_no_trans > 0')

#Solution 2
visits[~visits['visit_id'].isin(transactions['visit_id'])][['customer_id']].value_counts().reset_index().rename(columns = {'count' : 'count_no_trans'})

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_14840\3777738636.py:20: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  count_no_trans = ('transaction_id', lambda x: x.isnull().sum())).reset_index().query('count_no_trans > 0')

   customer_id  count_no_trans
0           54               2
1           30               1
2           96               1

In [33]:
##197 - Rising Temperature

#DF
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

#Task
'''
Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).
Return the result table in any order.

column - id
'''

#Solution 1
weather = weather.merge(weather, how = 'cross',suffixes = ('1','2'))
(
    weather
    [(weather['recordDate1'] - weather['recordDate2'] == '-1 days') & (weather['temperature2'] > weather['temperature1'])]
    [['id2']]
    .rename(columns = {'id2' : 'id'})
)

'''
#Solution 2
weather.sort_values('recordDate', inplace = True)
weather['prev_tempt'] = weather.temperature.shift(1)
weather['prev_date'] = weather.recordDate.shift(1)

weather[(weather['recordDate'] - weather['prev_date'] == '1 days') & (weather['temperature'] > weather['prev_tempt'])][['id']]
'''

"\n#Solution 2\nweather.sort_values('recordDate', inplace = True)\nweather['prev_tempt'] = weather.temperature.shift(1)\nweather['prev_date'] = weather.recordDate.shift(1)\n\nweather[(weather['recordDate'] - weather['prev_date'] == '1 days') & (weather['temperature'] > weather['prev_tempt'])][['id']]\n"

In [34]:
##1068 - Product Sales Analysis I

#DF
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
data = [[100, 'Nokia'], [200, 'Apple'], [300, 'Samsung']]
product = pd.DataFrame(data, columns=['product_id', 'product_name']).astype({'product_id':'Int64', 'product_name':'object'})

#Task
'''
Write a solution to report the product_name, year, and price for each sale_id in the Sales table.
Return the resulting table in any order.

column - product_name, year, price
'''

#Solution

sales.merge(product, on = 'product_id', how = 'left')[['product_name', 'year','price']]

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

In [35]:
##1661 - Average Time of Process per Machine

#DF
data = [[0, 0, 'start', 0.712], [0, 0, 'end', 1.52], [0, 1, 'start', 3.14], [0, 1, 'end', 4.12], [1, 0, 'start', 0.55], [1, 0, 'end', 1.55], [1, 1, 'start', 0.43], [1, 1, 'end', 1.42], [2, 0, 'start', 4.1], [2, 0, 'end', 4.512], [2, 1, 'start', 2.5], [2, 1, 'end', 5]]
activity = pd.DataFrame(data, columns=['machine_id', 'process_id', 'activity_type', 'timestamp']).astype({'machine_id':'Int64', 'process_id':'Int64', 'activity_type':'object', 'timestamp':'Float64'})

#Task
'''
There is a factory website that has several machines each running the same number of processes. Write a solution to find the 
average time each machine takes to complete a process.The time to complete a process is the 'end' timestamp minus the 'start' timestamp. 
The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.
The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.
Return the result table in any order.

column - machine_id, processing_time
'''

#Solution 1
activity = (
    activity
    .merge(activity, on = ['machine_id', 'process_id'], how = 'left',suffixes = ('1','2'))
)

activity = activity[(activity['activity_type1'] == 'start') & (activity['activity_type2'] == 'end')]
activity['processing_time'] = activity['timestamp2'] - activity['timestamp1']
activity.groupby('machine_id').processing_time.mean().reset_index()

'''
#Solution 2
pivot = activity.pivot(
        index = ["machine_id", "process_id"],
        columns = "activity_type",
        values="timestamp"
    )
pivot['processing_time'] = pivot['end']-pivot['start']
pivot.groupby('machine_id')['processing_time'].mean().reset_index().round(3)
'''

'\n#Solution 2\npivot = activity.pivot(\n        index = ["machine_id", "process_id"],\n        columns = "activity_type",\n        values="timestamp"\n    )\npivot[\'processing_time\'] = pivot[\'end\']-pivot[\'start\']\npivot.groupby(\'machine_id\')[\'processing_time\'].mean().reset_index().round(3)\n'

In [36]:
##577 - Employee Bonus

#DF
data = [[3, 'Brad', None, 4000], [1, 'John', 3, 1000], [2, 'Dan', 3, 2000], [4, 'Thomas', 3, 4000]]
employee = pd.DataFrame(data, columns=['empId', 'name', 'supervisor', 'salary']).astype({'empId':'Int64', 'name':'object', 'supervisor':'Int64', 'salary':'Int64'})
data = [[2, 500], [4, 2000]]
bonus = pd.DataFrame(data, columns=['empId', 'bonus']).astype({'empId':'Int64', 'bonus':'Int64'})

#Task
'''
Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.
Return the result table in any order.

column - name, bonus
'''

e = employee.merge(bonus, on = 'empId', how = 'left')
e[(e['bonus']<1000) | e['bonus'].isnull()][['name','bonus']]

   name  bonus
0  Brad   <NA>
1  John   <NA>
2   Dan    500